packages/archaea-simulation/archaea_simulation-1.2.1-py3-none-any.whl/archaea_simulation/cfd/case/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// number of subdomains to replace

method          hierarchical;
// method          ptscotch;

simpleCoeffs
{
    n               (4 1 1);
}

// hierarchicalCoeffs to replace


manualCoeffs
{
    dataFile        "cellDecomposition";
}


// ************************************************************************* //
